# Agregaciones y agrupaciones

In [1]:
import numpy as np
import pandas as pd

### Ej 2. Importar el conjunto de datos desde este [enlace](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Ej 3. Asígnalo a una variable llamada drinks.

In [9]:
drinks=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv', keep_default_na=False)
#CASO ESPECIAL: en los continentes norte america viene resumida como NA y python entiende esto como un valor nulo.
#Para evitar esto usamos keep_default_na que pone en los na-s su nombre

In [2]:
#Mas entendible con lo que hemos visto
drinks=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')
drinks.continent.fillna('NA',inplace=True)

Para empezar analizo la información general del DataSet.

In [3]:
drinks.shape

(193, 6)

In [4]:
len(drinks.country.unique()) #Me da la misma longitud que las lineas del array por lo tanto ningún dato se repite en countrys

193

In [3]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [4]:
drinks.dropna().describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [40]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Ej 4. ¿Qué continente bebe más cerveza en promedio?

In [6]:
drinks.groupby('continent')['beer_servings'].mean().sort_values(ascending=False)

continent
EU    193.777778
SA    175.083333
NA    145.434783
OC     89.687500
AF     61.471698
AS     37.045455
Name: beer_servings, dtype: float64

In [19]:
drinks.groupby('continent')['beer_servings'].mean().idxmax()

'EU'

a) Opción 1

In [15]:
media_cerveza=drinks.groupby('continent')['beer_servings'].mean() 
media_cerveza[media_cerveza.values==media_cerveza.max()]

continent
EU    193.777778
Name: beer_servings, dtype: float64

Explicación paso a paso:

In [10]:
#Agrupamos los datos por continentes (vemos que existen datos ausentes en la columna de continente) y calculamos la media
media_cerveza=drinks.groupby('continent')['beer_servings'].mean()
print(media_cerveza)

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [11]:
maximo1=media_cerveza.max()
maximo1

193.77777777777777

In [12]:
media_cerveza[media_cerveza.values==maximo1]

continent
EU    193.777778
Name: beer_servings, dtype: float64

b) Opción 2

In [17]:
media_cerveza2=drinks.groupby('continent', as_index=False)['beer_servings'].mean() #Ponemos as_index como false para que nos coja 'continent' como una columna y no como indice
media_cerveza2

  continent  beer_servings
0        AF      61.471698
1        AS      37.045455
2        EU     193.777778
3        OC      89.687500
4        SA     175.083333

In [30]:
maximo2=media_cerveza2.beer_servings.max()
media_cerveza2[media_cerveza2.values==maximo2] #['continent'] asi solo saldria el continente

  continent  beer_servings
2        EU     193.777778

C) Opción 3: TENGO UNA DUDA AQUI PREGUNTAR!!!

In [38]:
drinks.groupby('continent', as_index=False)['beer_servings'].mean()['beer_servings'].max()

193.77777777777777

### Ej 5. Para cada continente imprima las estadísticas de consumo de vino.

In [52]:
drinks.groupby('continent')['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [67]:
drinks.groupby('continent')['wine_servings'].describe().unstack()

       continent
count  AF            53.000000
       AS            44.000000
       EU            45.000000
       OC            16.000000
       SA            12.000000
mean   AF            16.264151
       AS             9.068182
       EU           142.222222
       OC            35.625000
       SA            62.416667
std    AF            38.846419
       AS            21.667034
       EU            97.421738
       OC            64.555790
       SA            88.620189
min    AF             0.000000
       AS             0.000000
       EU             0.000000
       OC             0.000000
       SA             1.000000
25%    AF             1.000000
       AS             0.000000
       EU            59.000000
       OC             1.000000
       SA             3.000000
50%    AF             2.000000
       AS             1.000000
       EU           128.000000
       OC             8.500000
       SA            12.000000
75%    AF            13.000000
       AS             8.000000
       EU           195.000000
       OC            23.250000
       SA            98.500000
max    AF           233.000000
       AS           123.000000
       EU           370.000000
       OC           212.000000
       SA           221.000000
dtype: float64

### Ej 6. Imprima el consumo medio de alcohol por continente para cada columna.

In [57]:
drinks.groupby('continent')[['beer_servings','spirit_servings','wine_servings','total_litres_of_pure_alcohol']].mean()
#HAY ALGUNA MANERA DE HACERLO SIN PONER LOS NOMBRES DE COLUMAS????

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Ej 7. Imprima la mediana del consumo de alcohol por continente para cada columna.

In [65]:
drinks.groupby('continent')[['beer_servings','spirit_servings','wine_servings','total_litres_of_pure_alcohol']].median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Ej 8. Imprima los valores medio, mínimo y máximo para el consumo de bebidas espirituosas por continente.

In [66]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [69]:
drinks.groupby('continent')['spirit_servings'].aggregate(['mean','min','max'])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302

In [25]:
drinks.groupby('continent').aggregate({'spirit_servings':['mean','min','max']})

          spirit_servings
                     mean min  max
continent
AF              16.339623   0  152
AS              60.840909   0  326
EU             132.555556   0  373
NA             165.739130  68  438
OC              58.437500   0  254
SA             114.750000  25  302